Repository: chefblogger/WP-Smart-SEO
Catalog: languages/wp-smart-seo-*.po
Languages: de_ch

source: Status Global Textfield
de_ch: Status vom globale Textfäld

source: Yes
de_ch: Jo

source: No
de_ch: Nei

source: Save
de_ch: Sichere

source: Global Textfield
de_ch: Globales Täxtfäld

source: Inserted at the End of each Title
de_ch: Chunt am endi vom Titäl ane

source: Which SEO Plugin did you used before?
de_ch: Weles SEO Plugin häsch du vorher verwendet?

source: New WP Installation / Never used a seo plugin here
de_ch: Neui WP Installation / i ha do no nie es seo plugin igsezt

source: Reset
de_ch: Zrugsetze

source: Plugin recommendation
de_ch: Plögin empfelig

source: if you need an xml sitemap for your wordpress, i recommend my other plugin called "Simple XML Sitemap Generator".
de_ch: Wenn du ä xml Sitemap für diis WördPress wötsch, denn empfehl i dir mis anderi Plögin wo heisst „Simple XML Sitemap Generator“.

source: Download:
de_ch: Abelade:

source: If you want to install google analytics (Universal and GA4), then I recommend this plugin "Quick Google Analytics".
de_ch: Wenn du google analytics bi diir au no wötsch installiere (UA oder GA4) denn empfehl i dir mis anderi plögin wo „Quick Google Analytics“ heisst.

source: all 3 plugins work perfectly together
de_ch: alli 3 plögins schaffet perfekt mitenand

source: Information
de_ch: Info

source: This "WP Smart SEO" Plugin is created by
de_ch: Das „Wp Smart SEO „ Plögin isch gschaffe worde vo

source: ERROR - Field empty
de_ch: FÄÄÄHLER - Läärs feld

source: Google Title
de_ch: Google Titäl

source: This is the Title Meta Tag for Google
de_ch: Das isch de Titäl Meta Täg vo Google

source: Google Description
de_ch: Google Beschriibig

source: This is the Description Meta Tag for Google
de_ch: Das isch de Beschriibigs Meta Täg vo Google

source: Facebook Title
de_ch: Facebook Titäl

source: This is the Title Meta Tag for Facebook
de_ch: Das isch de Titäl Meta Täg vo Facebook

source: Facebook Description
de_ch: Facebook Beschriibig

source: This is the Description Meta Tag for Facebook
de_ch: Das isch de Beschriibigs Meta Täg vo Facebook

source: Facebook Image
de_ch: Facebook Bild

source: This is the Image Meta Tag for Facebook
de_ch: Das isch de Bilder Meta Täg vo Facebook

source: Twitter Title
de_ch: Twitter Titäl

source: This is the Title Meta Tag for Twitter
de_ch: Das isch de Titäl Meta Täg vo Twitter

source: Twitter Description
de_ch: Twitter Beschriibig

source: This is the Description Meta Tag for Twitter
de_ch: Das isch de Beschriibigs Meta Täg vo Twitter

source: Twitter Image
de_ch: Twitter Bild

source: This is the Image Meta Tag for Twitter
de_ch: Das isch de Bilder Meta Täg vo Twitter

source: This is the description Meta Tag for Google
de_ch: Das isch de Beschriibigs Meta Täg vo Google

source: This is the description Meta Tag for Facebook
de_ch: Das isch de Beschriibigs Meta Täg vo Facebook

source: This is the description Meta Tag for Twitter
de_ch: Das isch de Beschriibigs Meta Täg vo Twitter

source: Indexing
de_ch: Indexierig

source: Title
de_ch: Titäl

source: Description
de_ch: Beschriibig

source: Facebook Image URL
de_ch: Facebook Bilder URL

source: Twitter Image URL
de_ch: Twitter Bilder URL
